# Author：Steve
'''
显示颜色格式：\033[显示方式;字体色;背景色m......[\033[0m]
-------------------------------------------
字体色     |       背景色     |      颜色描述
-------------------------------------------
30        |        40       |       黑色
31        |        41       |       红色
32        |        42       |       绿色
33        |        43       |       黃色
34        |        44       |       蓝色
35        |        45       |       紫红色
36        |        46       |       青蓝色
37        |        47       |       白色
-------------------------------------------
-------------------------------
显示方式     |      效果
-------------------------------
0           |     终端默认设置
1           |     高亮显示
4           |     使用下划线
5           |     闪烁
7           |     反白显示
8           |     不可见
-------------------------------
例子
print('This is a \033[1;35m test \033[0m!')
print('This is a \033[1;32;43m test \033[0m!')
print('\033[1;33;44mThis is a test !\033[0m')
'''

print('This is a \033[1;35m test \033[0m!')
print('This is a \033[1;32;43m test \033[0m!')
print('\033[1;33;44mThis is a test !\033[0m')

print("\033[0;37;40m 大神 \033[0m")
print("\033[1;37;40m 大神 \033[0m")
print("\033[4;37;40m 大神 \033[0m")
print("\033[5;37;44m 大神 \033[40m")
print("\033[7;37;40m 大神 \033[0m")
print("\033[8;37;40m 大神 \033[0m")

# print换行
for i in range(0, 10):
    print(i)
# print不换行
for x in range(0, 10):
    print(x, end='')
